const wuqing = [
    {
        "gift": "剥皮小刀",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "15",
        "顾惜朝": "5",
        "燕无归": "15"
    },
    {
        "gift": "拨浪鼓",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "20"
    },
    {
        "gift": "薄荷",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "20"
    },
    {
        "gift": "筚篥",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "15",
        "燕无归": "20"
    },
    {
        "gift": "碧血战铠",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "15",
        "燕无归": "20"
    },
    {
        "gift": "碧血毒蝎",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "碧血战籍",
        "无情": "20",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "布老虎",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "5",
        "燕无归": "10"
    },
    {
        "gift": "冰糖糕",
        "无情": "20",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "半截蜡烛",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "茶叶",
        "无情": "5",
        "叶问舟": "0",
        "方应看": "0",
        "顾惜朝": "5",
        "燕无归": "0"
    },
    {
        "gift": "彩球",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "草帽",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "蹴鞠",
        "无情": "5",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "5",
        "燕无归": "15"
    },
    {
        "gift": "词韵曲谱",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "20",
        "燕无归": "5"
    },
    {
        "gift": "钓竿",
        "无情": "0",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "20",
        "燕无归": "5"
    },
    {
        "gift": "冬虫夏草",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "风俗画",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "关外鹿皮",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "关外人参",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "关外鹿肉",
        "无情": "5",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "20"
    },
    {
        "gift": "鬼谷算盘",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "10",
        "燕无归": "20"
    },
    {
        "gift": "蝈蝈笼",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "5",
        "燕无归": "10"
    },
    {
        "gift": "枸杞",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "蛊毒书",
        "无情": "0",
        "叶问舟": "20",
        "方应看": "0",
        "顾惜朝": "0",
        "燕无归": "10"
    },
    {
        "gift": "高丽泡菜",
        "无情": "10",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "5",
        "燕无归": "15"
    },
    {
        "gift": "弓箭",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "花瓶",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "花盆土",
        "无情": "2",
        "叶问舟": "5",
        "方应看": "2",
        "顾惜朝": "5",
        "燕无归": "2"
    },
    {
        "gift": "红泪面脂",
        "无情": "5",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "5"
    },
    {
        "gift": "海螺",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "胡笳十八拍",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "20",
        "燕无归": "5"
    },
    {
        "gift": "黑白玲珑子",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "20",
        "燕无归": "15"
    },
    {
        "gift": "虎骨酒",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "虎皮围裙",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "虎皮包裹",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "0",
        "顾惜朝": "0",
        "燕无归": "20"
    },
    {
        "gift": "花灯",
        "无情": "15",
        "叶问舟": "0",
        "方应看": "0",
        "顾惜朝": "0",
        "燕无归": "0"
    },
    {
        "gift": "荷包",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "5"
    },
    {
        "gift": "河豚",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "和田玉坠",
        "无情": "20",
        "叶问舟": "20",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "和田玉石",
        "无情": "20",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "20"
    },
    {
        "gift": "化骨水",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "15",
        "顾惜朝": "5",
        "燕无归": "10"
    },
    {
        "gift": "火铳",
        "无情": "20",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "毁诺城女装",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "5"
    },
    {
        "gift": "金绣铁骨扇",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "金丝楠木",
        "无情": "20",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "金叶子",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "嘉禾肉粽",
        "无情": "5",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "酒葫芦",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "机械鸟",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "鸡毛掸子",
        "无情": "5",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "5",
        "燕无归": "10"
    },
    {
        "gift": "毽子",
        "无情": "5",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "绢花绸伞",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "5"
    },
    {
        "gift": "江山笔记",
        "无情": "15",
        "叶问舟": "20",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "剑门豆腐",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "孔雀石",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "孔雀翎",
        "无情": "10",
        "叶问舟": "5",
        "方应看": "20",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "柳笛",
        "无情": "15",
        "叶问舟": "20",
        "方应看": "10",
        "顾惜朝": "20",
        "燕无归": "10"
    },
    {
        "gift": "鎏金碧玉勺",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "5",
        "燕无归": "10"
    },
    {
        "gift": "灵芝",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "莲花河灯",
        "无情": "15",
        "叶问舟": "20",
        "方应看": "10",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "绿茶茶叶",
        "无情": "5",
        "叶问舟": "2",
        "方应看": "5",
        "顾惜朝": "5",
        "燕无归": "2"
    },
    {
        "gift": "楼兰蜜酒",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "狼毫笔",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "5",
        "顾惜朝": "5",
        "燕无归": "2"
    },
    {
        "gift": "龙渊",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "15",
        "燕无归": "20"
    },
    {
        "gift": "龙井黑猪肉",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "5",
        "燕无归": "15"
    },
    {
        "gift": "棉花",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "5"
    },
    {
        "gift": "面粉",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "磨刀石",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "5",
        "顾惜朝": "2",
        "燕无归": "5"
    },
    {
        "gift": "明前龙井",
        "无情": "20",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "20",
        "燕无归": "10"
    },
    {
        "gift": "沐浴香药",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "5"
    },
    {
        "gift": "女儿红",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "泥鳅",
        "无情": "10",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "5",
        "燕无归": "15"
    },
    {
        "gift": "霹雳堂炮仗",
        "无情": "15",
        "叶问舟": "5",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "霹雳堂火器",
        "无情": "20",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "判官笔",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "苹果",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "葡萄",
        "无情": "10",
        "叶问舟": "20",
        "方应看": "0",
        "顾惜朝": "0",
        "燕无归": "0"
    },
    {
        "gift": "邛窑茶盏",
        "无情": "20",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "庆历善治方",
        "无情": "15",
        "叶问舟": "20",
        "方应看": "10",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "青铜锭",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "青城脸谱",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "契丹瓜子",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "契丹牛乳",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "5",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "汝窑茶盏",
        "无情": "20",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "阮",
        "无情": "10",
        "叶问舟": "5",
        "方应看": "10",
        "顾惜朝": "20",
        "燕无归": "5"
    },
    {
        "gift": "三合美酒",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "20",
        "燕无归": "15"
    },
    {
        "gift": "梳妆匣",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "10",
        "顾惜朝": "5",
        "燕无归": "5"
    },
    {
        "gift": "神秘妆匣",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "时空碎片",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "司南",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "碎月海龟",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "5",
        "燕无归": "10"
    },
    {
        "gift": "碎月明虾",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "蒜香排骨",
        "无情": "15",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "5",
        "燕无归": "15"
    },
    {
        "gift": "蓑衣",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "锁子甲",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "20"
    },
    {
        "gift": "扇子",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "5"
    },
    {
        "gift": "兽皮包裹",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "20"
    },
    {
        "gift": "水域全图",
        "无情": "20",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "5"
    },
    {
        "gift": "蛇骨手串",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "铜镜",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "铜丝手套",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "20"
    },
    {
        "gift": "糖葫芦",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "陶罐",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "5",
        "燕无归": "2"
    },
    {
        "gift": "桃花雪",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "桃木剑",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "桃溪钓竿",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "20",
        "燕无归": "5"
    },
    {
        "gift": "桃溪花枝",
        "无情": "20",
        "叶问舟": "20",
        "方应看": "5",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "桃溪豆腐",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "桃溪河虾",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "5",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "桃溪泥人",
        "无情": "15",
        "叶问舟": "20",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "铁骨扇",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "团扇",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "5",
        "燕无归": "5"
    },
    {
        "gift": "武经总要",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "20",
        "燕无归": "15"
    },
    {
        "gift": "武安蹴鞠",
        "无情": "5",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "5",
        "燕无归": "15"
    },
    {
        "gift": "武林秘籍",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "小暖",
        "无情": "15",
        "叶问舟": "20",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "宣州紫毫笔",
        "无情": "15",
        "叶问舟": "20",
        "方应看": "15",
        "顾惜朝": "20",
        "燕无归": "5"
    },
    {
        "gift": "西域炼乳",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "西域葡萄",
        "无情": "10",
        "叶问舟": "20",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "西湖莲花",
        "无情": "15",
        "叶问舟": "20",
        "方应看": "5",
        "顾惜朝": "20",
        "燕无归": "10"
    },
    {
        "gift": "西湖莲蓬",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "10",
        "顾惜朝": "20",
        "燕无归": "10"
    },
    {
        "gift": "西域宝刀",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "20"
    },
    {
        "gift": "熙春调味料",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "151",
        "顾惜朝": "0",
        "燕无归": "15"
    },
    {
        "gift": "绣花绢帕",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "10",
        "燕无归": "5"
    },
    {
        "gift": "雪狐皮",
        "无情": "10",
        "叶问舟": "5",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "雪村鸡蛋",
        "无情": "10",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "雪梨",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "一屉包子",
        "无情": "15",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "一束桃花",
        "无情": "20",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "一朵莲花",
        "无情": "0",
        "叶问舟": "20",
        "方应看": "5",
        "顾惜朝": "0",
        "燕无归": "0"
    },
    {
        "gift": "一捆线球",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一捆麻绳",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一袋大米",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一袋大麦",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一袋麦麸",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一袋红豆",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一袋面粉",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一篮蔬菜",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一个茄子",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一根萝卜",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一片枫叶",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "5"
    },
    {
        "gift": "一块帆布",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一块木板",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一颗大白菜",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "一块粗麻布",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "药粥",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "15"
    },
    {
        "gift": "玉红叶",
        "无情": "10",
        "叶问舟": "15",
        "方应看": "20",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "玉扳指",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "15",
        "燕无归": "10"
    },
    {
        "gift": "萤火虫",
        "无情": "20",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "20"
    },
    {
        "gift": "养颜阿胶",
        "无情": "5",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "5",
        "燕无归": "5"
    },
    {
        "gift": "羊毫笔",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "5",
        "顾惜朝": "5",
        "燕无归": "2"
    },
    {
        "gift": "野生牛筋",
        "无情": "10",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "10",
        "燕无归": "20"
    },
    {
        "gift": "月影碎空残卷",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "20",
        "顾惜朝": "20",
        "燕无归": "15"
    },
    {
        "gift": "云栖竹笋",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "20",
        "燕无归": "15"
    },
    {
        "gift": "竹陀螺",
        "无情": "15",
        "叶问舟": "5",
        "方应看": "15",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "竹哨",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    },
    {
        "gift": "竹笋",
        "无情": "15",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "20",
        "燕无归": "15"
    },
    {
        "gift": "竹竿",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "5"
    },
    {
        "gift": "竹笛",
        "无情": "0",
        "叶问舟": "20",
        "方应看": "0",
        "顾惜朝": "20",
        "燕无归": "0"
    },
    {
        "gift": "粽子",
        "无情": "5",
        "叶问舟": "5",
        "方应看": "5",
        "顾惜朝": "5",
        "燕无归": "5"
    },
    {
        "gift": "针线包",
        "无情": "2",
        "叶问舟": "2",
        "方应看": "2",
        "顾惜朝": "2",
        "燕无归": "2"
    },
    {
        "gift": "追风翼",
        "无情": "15",
        "叶问舟": "15",
        "方应看": "15",
        "顾惜朝": "15",
        "燕无归": "15"
    },
    {
        "gift": "醉螺",
        "无情": "10",
        "叶问舟": "10",
        "方应看": "10",
        "顾惜朝": "10",
        "燕无归": "10"
    }
];
const xueqing = [
    {
        "gift": "半截蜡烛",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "5",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "薄荷",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "筚篥",
        "yexueqing": "10",
        "lishishi": "20",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "碧血毒蝎",
        "yexueqing": "",
        "lishishi": "",
        "jimier": "",
        "huajiangli": "20",
        "wenrou": "5"
    },
    {
        "gift": "碧血战籍",
        "yexueqing": "10",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "15",
        "wenrou": "5"
    },
    {
        "gift": "碧血战铠",
        "yexueqing": "5",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "15",
        "wenrou": "5"
    },
    {
        "gift": "冰糖糕",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "拨浪鼓",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "",
        "huajiangli": "10",
        "wenrou": "20"
    },
    {
        "gift": "剥皮小刀",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "20",
        "wenrou": "15"
    },
    {
        "gift": "布老虎",
        "yexueqing": "15",
        "lishishi": "",
        "jimier": "10",
        "huajiangli": "",
        "wenrou": "10"
    },
    {
        "gift": "彩球",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "草帽",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "词韵曲谱",
        "yexueqing": "",
        "lishishi": "20",
        "jimier": "",
        "huajiangli": "",
        "wenrou": ""
    },
    {
        "gift": "蹴鞠",
        "yexueqing": "10",
        "lishishi": "",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "20"
    },
    {
        "gift": "冬虫夏草",
        "yexueqing": "10",
        "lishishi": "",
        "jimier": "20",
        "huajiangli": "10",
        "wenrou": ""
    },
    {
        "gift": "风俗画",
        "yexueqing": "",
        "lishishi": "10",
        "jimier": "20",
        "huajiangli": "",
        "wenrou": ""
    },
    {
        "gift": "高丽泡菜",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "15",
        "huajiangli": "",
        "wenrou": "5"
    },
    {
        "gift": "弓箭",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "枸杞",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "关外鹿皮",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "关外鹿肉",
        "yexueqing": "",
        "lishishi": "",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "关外人参",
        "yexueqing": "10",
        "lishishi": "15",
        "jimier": "20",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "鬼谷算盘",
        "yexueqing": "5",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "",
        "wenrou": "10"
    },
    {
        "gift": "蝈蝈笼",
        "yexueqing": "",
        "lishishi": "10",
        "jimier": "15",
        "huajiangli": "",
        "wenrou": "15"
    },
    {
        "gift": "海螺",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "和田玉石",
        "yexueqing": "15",
        "lishishi": "20",
        "jimier": "20",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "和田玉坠",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "20",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "河豚",
        "yexueqing": "10",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "荷包",
        "yexueqing": "10",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "黑白玲珑子",
        "yexueqing": "10",
        "lishishi": "15",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "红泪面脂",
        "yexueqing": "15",
        "lishishi": "20",
        "jimier": "20",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "胡笳十八拍",
        "yexueqing": "",
        "lishishi": "20",
        "jimier": "",
        "huajiangli": "5",
        "wenrou": "5"
    },
    {
        "gift": "虎骨酒",
        "yexueqing": "5",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "虎皮围裙",
        "yexueqing": "",
        "lishishi": "10",
        "jimier": "",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "花盆土",
        "yexueqing": "5",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "花瓶",
        "yexueqing": "5",
        "lishishi": "5",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "5"
    },
    {
        "gift": "化骨水",
        "yexueqing": "5",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "20",
        "wenrou": "5"
    },
    {
        "gift": "毁诺城女装",
        "yexueqing": "",
        "lishishi": "15",
        "jimier": "",
        "huajiangli": "5",
        "wenrou": "20"
    },
    {
        "gift": "火铳",
        "yexueqing": "5",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "20",
        "wenrou": "20"
    },
    {
        "gift": "机械鸟",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "20"
    },
    {
        "gift": "鸡毛掸子",
        "yexueqing": "10",
        "lishishi": "",
        "jimier": "15",
        "huajiangli": "5",
        "wenrou": "15"
    },
    {
        "gift": "嘉禾肉粽",
        "yexueqing": "",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "",
        "wenrou": "10"
    },
    {
        "gift": "剑门豆腐",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "毽子",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "",
        "wenrou": "15"
    },
    {
        "gift": "江山笔记",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "金丝楠木",
        "yexueqing": "10",
        "lishishi": "15",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "金绣铁骨扇",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "金叶子",
        "yexueqing": "10",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "酒葫芦",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "绢花绸伞",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "孔雀翎",
        "yexueqing": "",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "20",
        "wenrou": "10"
    },
    {
        "gift": "孔雀石",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "20",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "狼毫笔",
        "yexueqing": "2",
        "lishishi": "5",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "莲花河灯",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "灵芝",
        "yexueqing": "15",
        "lishishi": "20",
        "jimier": "20",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "鎏金碧玉勺",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "柳笛",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "龙井黑猪肉",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "龙渊",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "",
        "huajiangli": "20",
        "wenrou": "15"
    },
    {
        "gift": "楼兰蜜酒",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "20",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "绿茶茶叶",
        "yexueqing": "2",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "5",
        "wenrou": "2"
    },
    {
        "gift": "棉花",
        "yexueqing": "5",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "5",
        "wenrou": "2"
    },
    {
        "gift": "明前龙井",
        "yexueqing": "15",
        "lishishi": "20",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "磨刀石",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "5"
    },
    {
        "gift": "沐浴香药",
        "yexueqing": "",
        "lishishi": "20",
        "jimier": "20",
        "huajiangli": "",
        "wenrou": "15"
    },
    {
        "gift": "泥鳅",
        "yexueqing": "5",
        "lishishi": "5",
        "jimier": "15",
        "huajiangli": "5",
        "wenrou": "15"
    },
    {
        "gift": "女儿红",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "20"
    },
    {
        "gift": "判官笔",
        "yexueqing": "5",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "5",
        "wenrou": "5"
    },
    {
        "gift": "霹雳堂火器",
        "yexueqing": "5",
        "lishishi": "5",
        "jimier": "",
        "huajiangli": "20",
        "wenrou": ""
    },
    {
        "gift": "霹雳堂炮仗",
        "yexueqing": "5",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "15",
        "wenrou": "20"
    },
    {
        "gift": "苹果",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "5",
        "wenrou": ""
    },
    {
        "gift": "契丹瓜子",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "契丹牛乳",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "青城脸谱",
        "yexueqing": "5",
        "lishishi": "10",
        "jimier": "5",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "青铜锭",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "5",
        "wenrou": "5"
    },
    {
        "gift": "庆历善治方",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "邛窑茶盏",
        "yexueqing": "15",
        "lishishi": "20",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "汝窑茶盏",
        "yexueqing": "15",
        "lishishi": "20",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "阮",
        "yexueqing": "",
        "lishishi": "20",
        "jimier": "",
        "huajiangli": "",
        "wenrou": "5"
    },
    {
        "gift": "三合美酒",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "20"
    },
    {
        "gift": "扇子",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "",
        "wenrou": "10"
    },
    {
        "gift": "蛇骨手串",
        "yexueqing": "5",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "20",
        "wenrou": ""
    },
    {
        "gift": "神秘妆匣",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "时空碎片",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "兽皮包裹",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "梳妆匣",
        "yexueqing": "15",
        "lishishi": "20",
        "jimier": "20",
        "huajiangli": "",
        "wenrou": "20"
    },
    {
        "gift": "水域全图",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "司南",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "蒜香排骨",
        "yexueqing": "",
        "lishishi": "5",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "碎月海龟",
        "yexueqing": "10",
        "lishishi": "15",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "碎月明虾",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "蓑衣",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "锁子甲",
        "yexueqing": "5",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "糖葫芦",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "",
        "huajiangli": "",
        "wenrou": "20"
    },
    {
        "gift": "桃花雪",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "桃木剑",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "桃溪钓竿",
        "yexueqing": "15",
        "lishishi": "",
        "jimier": "",
        "huajiangli": "",
        "wenrou": "10"
    },
    {
        "gift": "桃溪豆腐",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "桃溪河虾",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": ""
    },
    {
        "gift": "桃溪花枝",
        "yexueqing": "20",
        "lishishi": "",
        "jimier": "",
        "huajiangli": "",
        "wenrou": ""
    },
    {
        "gift": "桃溪泥人",
        "yexueqing": "20",
        "lishishi": "",
        "jimier": "",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "陶罐",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "5",
        "wenrou": "5"
    },
    {
        "gift": "铜镜",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "铜丝手套",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "20",
        "wenrou": "15"
    },
    {
        "gift": "团扇",
        "yexueqing": "10",
        "lishishi": "20",
        "jimier": "20",
        "huajiangli": "",
        "wenrou": "5"
    },
    {
        "gift": "武安蹴鞠",
        "yexueqing": "10",
        "lishishi": "",
        "jimier": "",
        "huajiangli": "10",
        "wenrou": "20"
    },
    {
        "gift": "武经总要",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "5",
        "huajiangli": "5",
        "wenrou": "5"
    },
    {
        "gift": "武林秘籍",
        "yexueqing": "10",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "20",
        "wenrou": "15"
    },
    {
        "gift": "西湖莲花",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "西湖莲蓬",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "西域炼乳",
        "yexueqing": "10",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "西域葡萄",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "熙春调味料",
        "yexueqing": "10",
        "lishishi": "",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": ""
    },
    {
        "gift": "绣花绢帕",
        "yexueqing": "",
        "lishishi": "15",
        "jimier": "20",
        "huajiangli": "",
        "wenrou": ""
    },
    {
        "gift": "宣州紫毫笔",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "雪村鸡蛋",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "雪狐皮",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "20",
        "wenrou": "15"
    },
    {
        "gift": "雪梨",
        "yexueqing": "15",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "羊毫笔",
        "yexueqing": "2",
        "lishishi": "5",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "养颜阿胶",
        "yexueqing": "20",
        "lishishi": "20",
        "jimier": "20",
        "huajiangli": "20",
        "wenrou": "20"
    },
    {
        "gift": "药粥",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "5"
    },
    {
        "gift": "野生牛筋",
        "yexueqing": "",
        "lishishi": "",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "15"
    },
    {
        "gift": "一袋大麦",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一袋大米",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一袋红豆",
        "yexueqing": "2",
        "lishishi": "5",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一袋麦麸",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一袋面粉",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一根萝卜",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一根茄子",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "5",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一颗大白菜",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一块粗麻布",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一块帆布",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一块木板",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一捆麻绳",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "5",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一捆线球",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一篮蔬菜",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "一片枫叶",
        "yexueqing": "5",
        "lishishi": "2",
        "jimier": "5",
        "huajiangli": "5",
        "wenrou": "2"
    },
    {
        "gift": "一束桃花",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "一屉包子",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "10"
    },
    {
        "gift": "一枝寒梅",
        "yexueqing": "",
        "lishishi": "",
        "jimier": "",
        "huajiangli": "20",
        "wenrou": ""
    },
    {
        "gift": "萤火虫",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "玉扳指",
        "yexueqing": "5",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "20",
        "wenrou": "15"
    },
    {
        "gift": "玉红叶",
        "yexueqing": "15",
        "lishishi": "20",
        "jimier": "20",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "月影碎空残卷",
        "yexueqing": "15",
        "lishishi": "5",
        "jimier": "5",
        "huajiangli": "20",
        "wenrou": "15"
    },
    {
        "gift": "云栖竹笋",
        "yexueqing": "20",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "针线包",
        "yexueqing": "5",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "2"
    },
    {
        "gift": "竹竿",
        "yexueqing": "2",
        "lishishi": "2",
        "jimier": "2",
        "huajiangli": "2",
        "wenrou": "5"
    },
    {
        "gift": "竹哨",
        "yexueqing": "15",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "10"
    },
    {
        "gift": "竹陀螺",
        "yexueqing": "15",
        "lishishi": "",
        "jimier": "10",
        "huajiangli": "10",
        "wenrou": "20"
    },
    {
        "gift": "追风翼",
        "yexueqing": "10",
        "lishishi": "10",
        "jimier": "10",
        "huajiangli": "15",
        "wenrou": "15"
    },
    {
        "gift": "粽子",
        "yexueqing": "5",
        "lishishi": "2",
        "jimier": "",
        "huajiangli": "5",
        "wenrou": "5"
    },
    {
        "gift": "醉螺",
        "yexueqing": "10",
        "lishishi": "15",
        "jimier": "15",
        "huajiangli": "10",
        "wenrou": "15"
    }
];